ZaxonChow/STM32F407/2023 07 09 USART/User/LED/bsp_led.h
#ifndef _BSP_LED_H
#define _BSP_LED_H

#include "stm32f4xx.h"                  // Device header            

//引脚定义
/*******************************************************/
//R 红色灯
#define LED1_PIN                  GPIO_Pin_6                 
#define LED1_GPIO_PORT            GPIOF                      
#define LED1_GPIO_CLK             RCC_AHB1Periph_GPIOF

//G 绿色灯
#define LED2_PIN                  GPIO_Pin_7                 
#define LED2_GPIO_PORT            GPIOF                      
#define LED2_GPIO_CLK             RCC_AHB1Periph_GPIOF

//B 蓝色灯
#define LED3_PIN                  GPIO_Pin_8                 
#define LED3_GPIO_PORT            GPIOF                       
#define LED3_GPIO_CLK             RCC_AHB1Periph_GPIOF
/************************************************************/


/** 控制LED灯亮灭的宏，
	* LED低电平亮，设置ON=0，OFF=1
	* 若LED高电平亮，把宏设置成ON=1 ，OFF=0 即可
	*/
#define ON  0
#define OFF 1

/* 带参宏，可以像内联函数一样使用 */
#define LED1(a)	if (a)	\
					GPIO_SetBits(LED1_GPIO_PORT,LED1_PIN);\
					else		\
					GPIO_ResetBits(LED1_GPIO_PORT,LED1_PIN)

#define LED2(a)	if (a)	\
					GPIO_SetBits(LED2_GPIO_PORT,LED2_PIN);\
					else		\
					GPIO_ResetBits(LED2_GPIO_PORT,LED2_PIN)

#define LED3(a)	if (a)	\
					GPIO_SetBits(LED3_GPIO_PORT,LED3_PIN);\
					else		\
					GPIO_ResetBits(LED3_GPIO_PORT,LED3_PIN)

/* 定义控制IO的宏 */
#define LED1_TOGGLE		GPIO_ToggleBits(LED1_GPIO_PORT,LED1_PIN)	//设置为高电平
#define LED1_OFF		GPIO_SetBits(LED1_GPIO_PORT,LED1_PIN)		//输出低电平
#define LED1_ON			GPIO_ResetBits(LED1_GPIO_PORT,LED1_PIN)		//输出反转状态

#define LED2_TOGGLE		GPIO_ToggleBits(LED2_GPIO_PORT,LED2_PIN)
#define LED2_OFF		GPIO_SetBits(LED2_GPIO_PORT,LED2_PIN)
#define LED2_ON			GPIO_ResetBits(LED2_GPIO_PORT,LED2_PIN)

#define LED3_TOGGLE		GPIO_ToggleBits(LED3_GPIO_PORT,LED3_PIN)
#define LED3_OFF		GPIO_SetBits(LED3_GPIO_PORT,LED3_PIN)
#define LED3_ON			GPIO_ResetBits(LED3_GPIO_PORT,LED3_PIN)

/* 基本混色，后面高级用法使用PWM可混出全彩颜色,且效果更好 */

//红
#define LED_RED  \
					LED1_ON;\
					LED2_OFF;\
					LED3_OFF

//绿
#define LED_GREEN		\
					LED1_OFF;\
					LED2_ON;\
					LED3_OFF

//蓝
#define LED_BLUE	\
					LED1_OFF;\
					LED2_OFF;\
					LED3_ON

					
//黄(红+绿)					
#define LED_YELLOW	\
					LED1_ON;\
					LED2_ON;\
					LED3_OFF
//紫(红+蓝)
#define LED_PURPLE	\
					LED1_ON;\
					LED2_OFF;\
					LED3_ON

//青(绿+蓝)
#define LED_CYAN \
					LED1_OFF;\
					LED2_ON;\
					LED3_ON
					
//白(红+绿+蓝)
#define LED_WHITE	\
					LED1_ON;\
					LED2_ON;\
					LED3_ON
					
//黑(全部关闭)
#define LED_RGBOFF	\
					LED1_OFF;\
					LED2_OFF;\
					LED3_OFF		




void LED_GPIO_Config(void);

#endif  //_BSP_LED_H
